SIDE_BUTTONS={
    "/start": "🏠 Главное меню",
    "/profile": "👤 Профиль",
    "/choose_ai": "🧠 Выбрать нейросеть",
    "/choose_role": "🎭 Выбрать роль бота",
    "/history": "📖 История запросов",
    "/clear_history": "🗑️ Очистить историю",
    "/policy": "🔒 Политика конфиденциальности",
}

INLINE_BUTTONS = {
    "show_profile": "👤 Профиль",
    "choose_ai": "🧠 Выбрать модель ИИ",
    "take_subscription": "💳 Оформить подписку",
    "choose_role": "🎭 Выбор роли",
    "https://t.me/w_ViIl": "💬 Служба поддержки",
}

AI_MODELS = {
    "gpt4o": "🧠 GPT-4o",
    "yandex_gpt": "🧠 Yandex GPT",
    "gigachat": "🧠 GigaChat",
    "perplexity": "🧠 Perplexity",
    "deepseek_v3": "🧠 DeepSeek v3",
    "claude_37": "🧠 Claude 3.7",
    "dalle3": "🖼️ DALL·E 3",
    "midjourney": "🖼️ Midjourney"
}

WELCOME_MESSAGE = """
👋 Просто напиши свой запрос в чат!
        
🆓 Вы можете пользоваться нашим ботом бесплатно!
❗️ Но для повышения эффективности рекомендуем купить нашу подписку за 1 рубль!

Функционал бота:
⤷ Отправь мне голосовое сообщение — я тебе отвечу на твой вопрос __(в разработке)__
⤷ Пришли мне фотографию с заданием — я тебе его решу __(в разработке)__
⤷ Напишу за тебя пост для блога, соцсетей, сформирую заявление или напишу полноценное сочинение
⤷ Решу любое задание или выполню работу за тебя
⤷ Нарисую для тебя картину с помощью Midjourney 7.0 или DALL•E 3 __(в разработке)__
⤷ Побуду твоим личным психологом или лучшим другом 

В нашей подписке собрано 7 самых полезных нейронок в мире! Они закрывают 99% задач любого человека
👇 Убедись сам всего за 1 рубль 👇
"""